flameletModel-2.1.x/tutorials/turbulentFlameletRhoSimpleFoam/SANDIA_CH4H2N2/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            kEpsilon;

turbulence          on;


//RASModel            laminar;

//turbulence          off;


printCoeffs         on;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu              0.09;
    C1               1.47;
    C2               1.92;
    C3               -0.33;
    alphah           1;
    alphak           1;
    alphaEps         0.76923;
    muLimiter       on;
    Lsgs             0.0002;

}

RNGkEpsilonCoeffs
{
    Cmu              0.0845;
    C1               1.42;
    C2               1.68;
    C3               -0.33;
    alphah           1;
    alphak           1.39;
    alphaEps         1.39;
    eta0             4.38;
    beta             0.012;
}

LaunderSharmaKECoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    C3               -0.33;
    alphah           1;
    alphak           1;
    alphaEps         0.76923;
}

LRRCoeffs
{
    Cmu              0.09;
    Clrr1            1.8;
    Clrr2            0.6;
    C1               1.44;
    C2               1.92;
    C3               -0.33;
    alphah           1;
    Cs               0.25;
    Ceps             0.15;
}

LaunderGibsonRSTMCoeffs
{
    Cmu              0.09;
    Clg1             1.8;
    Clg2             0.6;
    C1               1.44;
    C2               1.92;
    C3               -0.33;
    alphah           1;
    C1Ref            0.5;
    C2Ref            0.3;
    Cs               0.25;
    Ceps             0.15;
}

wallFunctionCoeffs
{
    kappa            0.4187;
    E                9;
}

// ************************************************************************* //
